# Ответы для Магического шара
ANSWERS = [
    "Бесспорно", "Предрешено", "Никаких сомнений", "Определённо да",
    "Можешь быть уверен в этом", "Мне кажется — «да»", "Вероятнее всего",
    "Хорошие перспективы", "Знаки говорят — «да»", "Да", "Пока не ясно, попробуй снова",
    "Спроси позже", "Лучше не рассказывать", "Сейчас нельзя предсказать",
    "Сконцентрируйся и спроси опять", "Даже не думай", "Мой ответ — «нет»",
    "По моим данным — «нет»", "Перспективы не очень хорошие", "Весьма сомнительно"
]

# Символы для генератора паролей и шифра Цезаря
UPPER_EN = 'ABCDEFGHIJKLMNOPQRSTUVWXYZ'
LOWER_EN = 'abcdefghijklmnopqrstuvwxyz'
UPPER_RU = 'АБВГДЕЖЗИЙКЛМНОПРСТУФХЦЧШЩЪЫЬЭЮЯ'
LOWER_RU = 'абвгдежзийклмнопрстуфхцчшщъыьэюя'
NUMBERS = '0123456789'
SEPARATORS = '-_'
SPECIAL_CHARACTERS = "!#$%&()*+./:;=>?@[\\]^`{|}~'\\"

# Словарь для угадайки слов
WORDS = [
    'Указатель', 'Радуга', 'Мармелад', 'Поиск', 'Прятки', 'Сторож', 'Копейка', 'Леопард', 
    'Аттракцион', 'Дрессировка', 'Ошейник', 'Карамель', 'Водолаз', 'Защита', 'Батарея',
    'Решётка', 'Квартира', 'Дельфинарий', 'Непогода','Вход', 'Полиция', 'Перекрёсток'
    'Башня', 'Стрелка', 'Градусник', 'Бутылка', 'Щипцы', 'Наволочка', 'Павлин', 'Карточка', 
    'Записка', 'Лестница', 'Переулок', 'Сенокос', 'Рассол', 'Закат', 'Сигнализация','Журнал', 
    'Заставка', 'Тиранозавр', 'Микрофон', 'Прохожий', 'Квитанция', 'Пауза', 'Новости',
    'Скарабей', 'Серебро', 'Творог', 'Осадок', 'Песня', 'Корзина', 'Сдача', 'Овчарка', 'Хлопья',
    'Телескоп', 'Микроб', 'Угощение', 'Экскаватор', 'Письмо', 'Пришелец', 'Айсберг', 'Пластик',
    'Доставка', 'Полка', 'Билет', 'Вторник', 'Льдина', 'Интерес', 'Троллейбус', 'Футболист', 
    'Лисёнок', 'Пример', 'Баклажан', 'Лягушка', 'Джокер', 'Котлета', 'Накидка', 'Дикобраз',
    'Барбарис', 'Работник', 'Кристалл', 'Доспехи', 'Халва', 'Велосипед', 'Крючок', 'Кочка', 
    'Черепаха', 'Петля', 'Осень', 'Яйцо'
]